# DisplacedElementDisplacementZ Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DisplacedElementDisplacementZ Property
ParameterTypeId Class See Also
---
"Z Displacement"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DisplacedElementDisplacementZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DisplacedElementDisplacementZ As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DisplacedElementDisplacementZ {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace